[
  {
    "roleDescription": [
      "As Clubs and Societies Officer you are responsible for assisting the Clubs and Societies Chair in overlooking the 17 clubs and societies that form part of the City and Guilds College Union. You are tasked with supporting them on an organisational level as well as helping them stay in line with the Union’s financial policies. You act as the deputy to the Clubs and Societies Chair, but the responsibilities are more or less the same.",
      "You have visibility over all clubs’ financial transactions and need to make sure that all of them are done correctly to ensure that societies’ planned activities run without any delays or difficulties, which occasionally involves a few runs to the Union. You are the clubs’ first point of contact to answer any questions they may have, which often involves digging through the Union website or getting in touch with the right people.",
      "Throughout the year you sit on the Clubs, Societies and Projects Board (CSPB) where you have a voice in deciding policies that affect clubs across the whole college! Here you also have the duty of representing the CGCU clubs’ views and concerns.",
      "You work very closely with the Clubs and Societies Chair, ICU’s Officer Trustees and ICU Staff to get all of this done – you are not alone, and will get a lot of help and support.",
      "Throughout the year you have the chance to see clubs develop and run some exciting events, where you know you played an important role in making it happen. This is what makes it a very rewarding experience!",
      "If you have any further questions don’t hesitate to get in touch with Owen via email at guilds.cso@imperial.ac.uk."
    ],
    "responsibilities": [
      "Assist the Clubs and Societies Chair in all of the below responsibilities",
      "Maintaining a watchful eye on the clubs, their activities and £250k of their expenditure",
      "Consistently checking eActivities to approve (or reject) clubs’ financial transactions",
      "Working closely with the Clubs and Societies Officer, ICU’s Officer Trustees and ICU Staff",
      "Developing CGCU Club officers to help them be the best they can be",
      "Represent CGCU clubs at ICU CSPB meetings",
      "Oversee the Annual Budgeting process for CGCU clubs"
    ],
    "skills": [
      "Organisation",
      "People skills & management",
      "Ideally prior experience in a role which manages finances (e.g. Club chair or Treasurer)"
    ],
    "roleName": "Clubs and Societies Officer"
  },
  {
    "roleDescription": [
      "At the heart of CGCU, the Education Officer’s role is a unique opportunity to solve academic issues faced by over 4200 students, helping to improve teaching standards across the Faculty of Engineering. You will not be alone in this role, you will act as a deputy to the Education Chair.",
      "You will work closely with Academic Dep Reps to help them excel in their role and bring department issues to faculty level, where you will work with senior Faculty staff to help solve them. The role also includes constant communication with Imperial College Union's Deputy President (Education) to ensure that the Faculty of Engineering is heading in the right direction in line with other faculties.",
      "This role will be great for you if you have had previous experience of student academic representation and now feel keen to widen your perspective from your Department to the entire Faculty. You will be invited to Faculty Teaching Committee meetings, Faculty Education Committee meetings and Student-Staff departmental meetings each term. In addition to this you will also sit on the Education and Representation Board, Union Council and the CGCU Committee which meet more frequently."
    ],
    "responsibilities": [
      "Work with the CGCU Education Chair",
      "Manage and assist the CGCU Academic Department Representatives in their role",
      "Raise issues at faculty level and work with Faculty Staff to solve them",
      "Raise issues from faculty and department to college-wide level via Union Council, and Education Representation Board",
      "Work with other CGCU teams to help you in your role",
      "Ease of access to shared training and resources",
      "Attend Education & Representation Board (ERB) four times a year",
      "Attend Faculty Teaching and Education Committees (FTC and FEC) once a month",
      "Work with ICU Deputy President (Education) and ICU Staff on campaigns/issues",
      "Help facilitate communication with department representatives and their staff",
      "Participate in the general leadership of the CGCU"
    ],
    "skills": [
      "Organisation & time keeping",
      "You will be expected to attend a lot of meetings",
      "Communication",
      "Proactive"
    ],
    "roleName": "Education Officer"
  },
  {
    "roleDescription": [
      "The Secretary is more than just minute-taking - they are one of the core members of the Executive Committee, a key part of the decision making process of the CGCU. You are expected to liaise with all committee members, assisting them in their role.",
      "You will be managing and sending emails on a regular basis, and our reputation lies in your communications. Your vigilance is equally required - plus your English competency and communication skills will come to their test, as various materials (both in professional communication and internal publicity) will await your cautious proofreading."
    ],
    "responsibilities": [
      "Oversee the accurate recording and compilation of minutes for all CGCU meetings, sending them out to all committee members afterwards",
      "Keep track of action points for committee members, and ensure they are actioned",
      "Ensure handover information is exchanged between incoming and outgoing CGCU Officers",
      "Prepare regular update emails to be sent to all CGCU members",
      "Provide general support in the organisation of CGCU events"
    ],
    "skills": [
      "Good (written) English",
      "Clear communication",
      "Enthusiastic",
      "Basic IT competency (sending emails, etc)"
    ],
    "roleName": "Secretary"
  },
  {
    "roleDescription": [
      "Implied by name of this position, its major role is to liaise with alumni groups. Our main alumni group is the City and Guilds College Association (CGCA), however there are also other alumni groups such as our founding Guilds (you can see all of their shields hanging in CAGB near the exit doors to Dalby Court), etc.",
      "The responsibility includes going along with the CGCU President to attend CGCA Committee meetings and OC Trust meetings, who are the charitable arm of the CGCA. In meetings, we discuss about the organisation of new events, which aim to strengthen the close relationship between CGCU and CGCA. This year, we successfully organised joint events with CGCA, including the CGCU Welcome Dinner, Reunion Lunch and a Women in Engineering event. In addition, the Alumni Officer will be representing CGCU in a number of events organised by CGCA, such as the Annual Dinner (free ticket)."
    ],
    "responsibilities": [
      "Liaise with alumni groups",
      "Attend CGCA meetings every month or two",
      "Attend OC Trust meetings every month or two",
      "Hand out any award cheques to students from the OC Trust",
      "Chair the awards committee",
      "Work with the CGCU Activities team to plan and promote alumni events"
    ],
    "skills": [
      "Good communication skills",
      "Good at building relationships with a variety of people",
      "Enthusiastic"
    ],
    "roleName": "Alumni Officer"
  },
  {
    "roleDescription": [
      "Your main responsibilities will be to always be on the search for sponsorship opportunities from companies for the CGCU, assist the in finding sponsorship for the Guildsheet magazine, help organise sponsor events with the CGCU Activities team, and write up the sponsorship contracts.",
      "Over the summer you will reassess the CGCU Sponsorship Pack and make any edits needed before sending it out to companies. The success of this position is based on your ability to communicate, negotiate and be innovative. Gaining lots of sponsorship for the CGCU also looks great on your CV as demonstrates so many transferable skills!"
    ],
    "responsibilities": [
      "Create the CGCU Sponsorship Pack",
      "Contact sponsors and guide them through all stages of the process",
      "Make sure sponsors are looked after",
      "Work with the events team to do this",
      "Make sure we receive the money through ICU financial processes"
    ],
    "skills": [
      "Communication",
      "Email-writing!",
      "Proactive"
    ],
    "roleName": "Sponsorship Officer"
  },
  {
    "roleDescription": [
      "The CGCU webmaster is responsible for maintaining the https://CGCU.net website as well as generally improving the software support that the committee has. There are a number of exciting opportunities to build new tools such as a self-service link shortening system for committee to use, a brand new site for GuildSheet or whatever else you think would be helpful for the committee. This is a great chance to improve your web dev skills and get some great experience taking the initiative developing solutions to people's problems. As a good engineer, you'll know what's possible and will be able to anticipate and understand what could be helpful for your fellow committee members or even the wider CGCU community.",
      "Currently, the website receives some minor updates but some work is required to improve the maintainability for the future (source code available at https://github.com/CGCU/cgcu-website). There's also a QR ticket app that is responsible for sending tickets for CGCU events and scanning them in that you would be responsible for maintaining."
    ],
    "responsibilities": [
      "Maintain the CGCU website and existing software (QR Ticket Scanner)",
      "Improve committee software support (e.g. admin automation)",
      "Upload the issues of Guildsheet (CGCU Magazine) and Spanner (Freshers Guidebook) as they are released.",
      "Maintain a record of CGCU Documents online, e.g. our Constitution, policies, and meeting minutes, in order to transparent to our members."
    ],
    "skills": [
      "Proficiency / willingness to learn PHP, Javascript, HTML and CSS",
      "Experience / willingness to learn the management of web servers",
      "Understanding of DNS management",
      "Some understanding of web security"
    ],
    "roleName": "Webmaster"
  },
  {
    "roleDescription": [
      "There area number of ways of approaching the job of Editor Guildsheet supremo. Probably the best way to start is simply from scratch with what you believe the Guilds Union, CGCU should be, what it is supposed to do and what student newspapers are supposed to be, and then take off in your own particular direction.",
      "You have a small budget, but within you have complete editorial freedom (as long as the President/Committee say so). There is no reason to follow what we have done this year (but we hope you like it!). Choose a style, subjects to write about and then the method of production: just make sure to give the guilds students something to read and that will get them involved. Here are some reasons for you to do it:",
      "You don't know anything about how newspapers are produced. I think anyone could be shown how to use InDesign and the basics of layout and design within a couple of hours. After that you're on your way.",
      "You don't need to be a union hack (whatever that is). The whole point of having an election is to allow anyone at all to get the Job!",
      "You don't have lots of time. Yes there is a lot of work, but you will have help - there are two roles available.",
      "You don't need to be able to Spell. I'm no eckspurt at Spelin ither.",
      "Ideally you, should able to talk other people into writing as much as possible, both to save you time and also to vary the texture of the magazine.",
      "Finally, being GS editor is an unparalleled opportunity to have a good time. I think editing Guildsheet is about as much fun as is possible without breaking the law or making a mess on the carpet. If anyone wasn't to inquire to see us about this once in a lifetime opportunity then email guildsheet@ic.ac.uk, or visit CAGB 350 for a chat."
    ],
    "responsibilities": [
      "Designing and editing every issue of Guildsheet; the 48-60 odd page Magazine of the Guilds Union. It’s a termly publication so two/three a year is enough for anyone!",
      "Contacting all the required people e.g. Sports officer or different CGCU Societies, to write articles for the Sheet",
      "Proofreading articles - this would be coordinated across the committee",
      "You may be required to create most of the pages e.g. the crosswords or puzzles, layouts",
      "Make sure any of the photos you require of both staff and students on campus are taken ready for each issue or source them if you can - coordinate with the media and marketing officer",
      "Required to contact printing company, gaining a quote for the printing per issue and sending off the final document",
      "RECRUIT your SQUAD - a team of minions to help you with its creation",
      "Work with the )Hopefully good) sponsorship officer to find advertisement or sponsored articles"
    ],
    "skills": [
      "Creativity and eye for design",
      "Enthusiasm",
      "Attention to detail",
      "Past experience or the willingness to learn in Adobe programs e.g. InDesign - however familiarity with the programs is preferred",
      "Need to be able to keep the printing deadline",
      "Infinite patience and banter would help"
    ],
    "roleName": "Guildsheet Editor (x2)"
  }
]